In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.1.3'

## Data Frames

In [3]:
data = {
    'State' : ['New York','Montreal','Vancouver','Texas','California','San Fransisco'],
    'Population' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.0],
    'Year' : [2000, 2001, 2002, 2001, 2002, 2003]
}

In [74]:
frame = pd.DataFrame(data)
frame

           State  Population  Year
0       New York         1.5  2000
1       Montreal         1.7  2001
2      Vancouver         3.6  2002
3          Texas         2.4  2001
4     California         2.9  2002
5  San Fransisco         3.0  2003

### Head and Tail Methods

In [75]:
frame.head()

        State  Population  Year
0    New York         1.5  2000
1    Montreal         1.7  2001
2   Vancouver         3.6  2002
3       Texas         2.4  2001
4  California         2.9  2002

In [76]:
frame.tail()

           State  Population  Year
1       Montreal         1.7  2001
2      Vancouver         3.6  2002
3          Texas         2.4  2001
4     California         2.9  2002
5  San Fransisco         3.0  2003

In [77]:
frame.head(3)

       State  Population  Year
0   New York         1.5  2000
1   Montreal         1.7  2001
2  Vancouver         3.6  2002

In [78]:
frame.tail(3)

           State  Population  Year
3          Texas         2.4  2001
4     California         2.9  2002
5  San Fransisco         3.0  2003

### Inserting a new column will contain null values

In [79]:
frame2 = pd.DataFrame(data,columns=['Year','State','Population','Tax'],index=[1,2,3,4,5,6])

In [80]:
frame2

   Year          State  Population  Tax
1  2000       New York         1.5  NaN
2  2001       Montreal         1.7  NaN
3  2002      Vancouver         3.6  NaN
4  2001          Texas         2.4  NaN
5  2002     California         2.9  NaN
6  2003  San Fransisco         3.0  NaN

In [81]:
frame2.columns

Index(['Year', 'State', 'Population', 'Tax'], dtype='object')

In [82]:
frame2['State']

1         New York
2         Montreal
3        Vancouver
4            Texas
5       California
6    San Fransisco
Name: State, dtype: object

In [83]:
frame2['Tax']

1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
6    NaN
Name: Tax, dtype: object

In [84]:
frame2['Population']

1    1.5
2    1.7
3    3.6
4    2.4
5    2.9
6    3.0
Name: Population, dtype: float64

In [85]:
frame2.Year

1    2000
2    2001
3    2002
4    2001
5    2002
6    2003
Name: Year, dtype: int64

In [86]:
frame2.loc[3]

Year               2002
State         Vancouver
Population          3.6
Tax                 NaN
Name: 3, dtype: object

In [87]:
frame2.loc[6]

Year                   2003
State         San Fransisco
Population                3
Tax                     NaN
Name: 6, dtype: object

In [88]:
frame2.loc[2]

Year              2001
State         Montreal
Population         1.7
Tax                NaN
Name: 2, dtype: object

In [89]:
frame2['Tax'] = 50

In [90]:
frame2

   Year          State  Population  Tax
1  2000       New York         1.5   50
2  2001       Montreal         1.7   50
3  2002      Vancouver         3.6   50
4  2001          Texas         2.4   50
5  2002     California         2.9   50
6  2003  San Fransisco         3.0   50

In [91]:
frame2['Tax'] = [36,55,86,74,88,45]

In [92]:
frame2

   Year          State  Population  Tax
1  2000       New York         1.5   36
2  2001       Montreal         1.7   55
3  2002      Vancouver         3.6   86
4  2001          Texas         2.4   74
5  2002     California         2.9   88
6  2003  San Fransisco         3.0   45

In [93]:
val = pd.Series([46,65,78],index=[2,4,6])
val

2    46
4    65
6    78
dtype: int64

In [94]:
frame2['Tax'] = val

In [95]:
frame2

   Year          State  Population   Tax
1  2000       New York         1.5   NaN
2  2001       Montreal         1.7  46.0
3  2002      Vancouver         3.6   NaN
4  2001          Texas         2.4  65.0
5  2002     California         2.9   NaN
6  2003  San Fransisco         3.0  78.0

### Simplest way to add a new column

In [96]:
frame2['GDP'] = frame2.State == 'Vancouver'

In [97]:
frame2

   Year          State  Population   Tax    GDP
1  2000       New York         1.5   NaN  False
2  2001       Montreal         1.7  46.0  False
3  2002      Vancouver         3.6   NaN   True
4  2001          Texas         2.4  65.0  False
5  2002     California         2.9   NaN  False
6  2003  San Fransisco         3.0  78.0  False

### Deleting or Removing a Column

In [98]:
del frame2['GDP']

In [99]:
frame2

   Year          State  Population   Tax
1  2000       New York         1.5   NaN
2  2001       Montreal         1.7  46.0
3  2002      Vancouver         3.6   NaN
4  2001          Texas         2.4  65.0
5  2002     California         2.9   NaN
6  2003  San Fransisco         3.0  78.0

In [100]:
frame2.columns

Index(['Year', 'State', 'Population', 'Tax'], dtype='object')

### Another Way To Create Data Frame

In [101]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [102]:
frame3 = pd.DataFrame(pop)

In [103]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

#### Outer Dictionary Keys ---> Columns Indices
#### Inner Dictionary Keys ---> Rows Indices

#### Transposing Data Frame

In [104]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

- Columns are changed into rows and rows are changed into columns.

In [105]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [106]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}

In [107]:
frame4 = pd.DataFrame(pdata)

In [108]:
frame4

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [109]:
frame4

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [110]:
frame4.Ohio

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [111]:
frame4.Ohio.mean()

2.65

In [112]:
frame2

   Year          State  Population   Tax
1  2000       New York         1.5   NaN
2  2001       Montreal         1.7  46.0
3  2002      Vancouver         3.6   NaN
4  2001          Texas         2.4  65.0
5  2002     California         2.9   NaN
6  2003  San Fransisco         3.0  78.0

In [113]:
frame2

   Year          State  Population   Tax
1  2000       New York         1.5   NaN
2  2001       Montreal         1.7  46.0
3  2002      Vancouver         3.6   NaN
4  2001          Texas         2.4  65.0
5  2002     California         2.9   NaN
6  2003  San Fransisco         3.0  78.0

### Index Objects

#### Responsibilities of index in Pandas:
- Holding the axis labels 
- Holding other metadata (e.g) axis name/names

In [114]:
obj = pd.Series(range(3),index=['a','b','c'])
obj

a    0
b    1
c    2
dtype: int64

In [115]:
index = obj.index

In [116]:
index

Index(['a', 'b', 'c'], dtype='object')

In [117]:
index[1:]

Index(['b', 'c'], dtype='object')

#### Index objects are immutable. We can't modifiy them.

In [118]:
# index[1:] = a
# Not executing the above code because it will throw error.

In [119]:
obj.dtype

dtype('int64')

In [120]:
import numpy as np

In [121]:
labels = pd.Index(np.arange(3))

In [122]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [123]:
np.array(labels)

array([0, 1, 2], dtype=int64)

In [124]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [125]:
frame2

   Year          State  Population   Tax
1  2000       New York         1.5   NaN
2  2001       Montreal         1.7  46.0
3  2002      Vancouver         3.6   NaN
4  2001          Texas         2.4  65.0
5  2002     California         2.9   NaN
6  2003  San Fransisco         3.0  78.0

In [126]:
frame2.Year.sum()

12009

In [127]:
frame2

   Year          State  Population   Tax
1  2000       New York         1.5   NaN
2  2001       Montreal         1.7  46.0
3  2002      Vancouver         3.6   NaN
4  2001          Texas         2.4  65.0
5  2002     California         2.9   NaN
6  2003  San Fransisco         3.0  78.0

In [128]:
"2003" in frame2.Year

False

In [129]:
"New York" in frame2.State

False

In [130]:
frame2.State

1         New York
2         Montreal
3        Vancouver
4            Texas
5       California
6    San Fransisco
Name: State, dtype: object

In [131]:
frame2.State[1]

'New York'

In [132]:
frame2.State

1         New York
2         Montreal
3        Vancouver
4            Texas
5       California
6    San Fransisco
Name: State, dtype: object